tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/CHIPCON/CC2543.h
/*-----------------------------------------------------------------------------
CC2543.H

Header file for Texas Instruments CC2543, CC2544, CC2545

Copyright (c) 2014 ARM Germany GmbH.
All rights reserved.
-------------------------------------------------------------------------------*/
#ifndef __CC2543_H__
#define __CC2543_H__


/* Module ADC                                            */
sfr ADCCON1 = 0xB4;   /* ADC ADC control 1 (not available on the CC2544)       */
sfr ADCCON2 = 0xB5;   /* ADC ADC control 2 (not available on the CC2544)       */
sfr ADCCON3 = 0xB6;   /* ADC ADC control 3 (not available on the CC2544)       */
sfr ADCL    = 0xBA;   /* ADC ADC data low (not available on the CC2544)        */
sfr ADCH    = 0xBB;   /* ADC ADC data high (not available on the CC2544)       */
sfr RNDL    = 0xBC;   /* ADC Random number generator data low                  */
sfr RNDH    = 0xBD;   /* ADC Random number generator data high                 */

                      /* Module AES                                            */
sfr ENCDI   = 0xB1;   /* AES Encryption/decryption input data                  */
sfr ENCDO   = 0xB2;   /* AES Encryption/decryption output data                 */
sfr ENCCS   = 0xB3;   /* AES Encryption/decryption control and status          */

                      /* Module CPU                                            */
sfr P0      = 0x80;   /* CPU Port 0. Readable from XDATA (0x7080)              */
sfr SP      = 0x81;   /* CPU Stack pointer                                     */
sfr DPL0    = 0x82;   /* CPU Data pointer 0 low byte                           */
sfr DPH0    = 0x83;   /* CPU Data pointer 0 high byte                          */
sfr DPL1    = 0x84;   /* CPU Data pointer 1 low byte                           */
sfr DPH1    = 0x85;   /* CPU Data pointer 0 high byte                          */
sfr PCON    = 0x87;   /* CPU Power mode control                                */
sfr TCON    = 0x88;   /* CPU Interrupt flags                                   */
sfr P1      = 0x90;   /* CPU Port 1. Readable from XDATA (0x7090)              */
sfr DPS     = 0x92;   /* CPU Data pointer select                               */
sfr S0CON   = 0x98;   /* CPU Interrupt flags 2                                 */
sfr IEN2    = 0x9A;   /* CPU Interrupt enable 2                                */
sfr S1CON   = 0x9B;   /* CPU Interrupt flags 3                                 */
sfr P2      = 0xA0;   /* CPU Port 2. Readable from XDATA (0x70A0) (not available on sfr the CC2544) */
sfr IEN0    = 0xA8;   /* CPU Interrupt enable 0                                */
sfr IP0     = 0xA9;   /* CPU Interrupt priority 0                              */
sfr IEN1    = 0xB8;   /* CPU Interrupt enable 1                                */
sfr IP1     = 0xB9;   /* CPU Interrupt priority 1                              */
sfr IRCON   = 0xC0;   /* CPU Interrupt flags 4                                 */
sfr PSW     = 0xD0;   /* CPU Program status Word                               */
sfr ACC     = 0xE0;   /* CPU Accumulator                                       */
sfr IRCON2  = 0xE8;   /* CPU Interrupt flags 5                                 */
sfr B       = 0xF0;   /* CPU B register                                        */
sfr P3      = 0xB0;   /* CPU Port 3. Readable from XDATA (0x70B0) (only available on the CC2545) */

                      /* Module DMA                                            */
sfr DMAIRQ    = 0xD1; /* DMA DMA interrupt flag                                */
sfr DMA1CFGL  = 0xD2; /* DMA DMA channel 1 configuration address low           */
sfr DMA1CFGH  = 0xD3; /* DMA DMA channel 1 configuration address high          */
sfr DMA0CFGL  = 0xD4; /* DMA DMA channel 0 configuration address low           */
sfr DMA0CFGH  = 0xD5; /* DMA DMA channel 0 configuration address high          */
sfr DMAARM    = 0xD6; /* DMA DMA channel armed                                 */
sfr DMAREQ    = 0xD7; /* DMA DMA channel start request and status              */

                      /* Memory                                                */
sfr MPAGE     = 0x93; /* MEMORY Memory page select                             */
sfr MEMCTR    = 0xC7; /* MEMORY Memory system control                          */

                      /* Module RF                                             */
sfr RFIRQF1   = 0x91; /* RF RF interrupt flags MSB                             */
sfr RFIRQF0   = 0xE9; /* RF RF interrupt flags LSB                             */
sfr RFD       = 0xD9; /* RF RF data                                            */
sfr RFST      = 0xE1; /* RF RF command strobe                                  */
sfr RFERRF    = 0xBF; /* RF RF error interrupt flags                           */

                      /* Module ST                                             */
sfr ST0       = 0x95; /* ST Sleep Timer 0                                      */
sfr ST1       = 0x96; /* ST Sleep Timer 1                                      */
sfr ST2       = 0x97; /* ST Sleep Timer 2                                      */
sfr STLOAD    = 0xAD; /* ST Sleep-timer load status                            */

                      /* Module PMC                                            */
sfr SLEEPCMD  = 0xBE; /* PMC Sleep-mode control command                        */
sfr SLEEPSTA  = 0x9D; /* PMC Sleep-mode control status                         */
sfr CLKCONCMD = 0xC6; /* PMC Clock control command                             */
sfr CLKCONSTA = 0x9E; /* PMC Clock control status                              */

                      /* Module Timer 1                                        */
sfr T1CC0L    = 0xDA; /* Timer 1 Timer 1 channel 0 capture/compare value low   */
sfr T1CC0H    = 0xDB; /* Timer 1 Timer 1 channel 0 capture/compare value high  */
sfr T1CC1L    = 0xDC; /* Timer 1 Timer 1 channel 1 capture/compare value low   */
sfr T1CC1H    = 0xDD; /* Timer 1 Timer 1 channel 1 capture/compare value high  */
sfr T1CC2L    = 0xDE; /* Timer 1 Timer 1 channel 2 capture/compare value low   */
sfr T1CC2H    = 0xDF; /* Timer 1 Timer 1 channel 2 capture/compare value high  */
sfr T1CNTL    = 0xE2; /* Timer 1 Timer 1 counter low                           */
sfr T1CNTH    = 0xE3; /* Timer 1 Timer 1 counter high                          */
sfr T1CTL     = 0xE4; /* Timer 1 Timer 1 control and status                    */
sfr T1CCTL0   = 0xE5; /* Timer 1 Timer 1 channel 0 capture/compare control     */
sfr T1CCTL1   = 0xE6; /* Timer 1 Timer 1 channel 1 capture/compare control     */
sfr T1CCTL2   = 0xE7; /* Timer 1 Timer 1 channel 2 capture/compare control     */
sfr T1STAT    = 0xAF; /* Timer 1 Timer 1 statu                                 */

