tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/CHIPCON/CC2543.h
                      /* Module Timer 2                                        */
sfr T2CTRL    = 0x94; /* Timer 2 Timer 2 control                               */
sfr T2EVTCFG  = 0x9C; /* Timer 2 Timer 2 event configuration                   */
sfr T2IRQF    = 0xA1; /* Timer 2 Timer 2 interrupt flags                       */
sfr T2M0      = 0xA2; /* Timer 2 Timer 2 multiplexed register 0                */
sfr T2M1      = 0xA3; /* Timer 2 Timer 2 multiplexed register 1                */
sfr T2MOVF0   = 0xA4; /* Timer 2 Timer 2 multiplexed overflow register 0       */
sfr T2MOVF1   = 0xA5; /* Timer 2 Timer 2 multiplexed overflow register 1       */
sfr T2MOVF2   = 0xA6; /* Timer 2 Timer 2 multiplexed overflow register 2       */
sfr T2IRQM    = 0xA7; /* Timer 2 Timer 2 interrupt mask                        */
sfr T2MSEL    = 0xC3; /* Timer 2 Timer 2 multiplex select                      */

                      /* Module Timer 3                                        */
sfr T3CNT     = 0xCA; /* Timer 3 Timer 3 counter                               */
sfr T3CTL     = 0xCB; /* Timer 3 Timer 3 control                               */
sfr T3CCTL0   = 0xCC; /* Timer 3 Timer 3 channel 0 compare control             */
sfr T3CC0     = 0xCD; /* Timer 3 Timer 3 channel 0 compare value               */
sfr T3CCTL1   = 0xCE; /* Timer 3 Timer 3 channel 1 compare control             */
sfr T3CC1     = 0xCF; /* Timer 3 Timer 3 channel 1 compare value               */

                      /* Module Timer 4                                        */
sfr T4CNT     = 0xEA; /* Timer 4 Timer 4 counter                               */
sfr T4CTL     = 0xEB; /* Timer 4 Timer 4 control                               */
sfr T4CCTL0   = 0xEC; /* Timer 4 Timer 4 channel 0 compare control             */
sfr T4CC0     = 0xED; /* Timer 4 Timer 4 channel 0 compare value               */
sfr T4CCTL1   = 0xEE; /* Timer 4 Timer 4 channel 1 compare control             */
sfr T4CC1     = 0xEF; /* Timer 4 Timer 4 channel 1 compare value               */

                      /* Module Timer interrupt                                */
sfr TIMIF     = 0xD8; /* TMINT Timers 1/3/4 joint interrupt mask/flags         */

                      /* Module USART                                          */
sfr U0CSR     = 0x86; /* USART 0 USART 0 control and status                    */
sfr U0DBUF    = 0xC1; /* USART 0 USART 0 receive/transmit data buffer          */
sfr U0BAUD    = 0xC2; /* USART 0 USART 0 baud-rate control                     */
sfr U0UCR     = 0xC4; /* USART 0 USART 0 UART control                          */
sfr U0GCR     = 0xC5; /* USART 0 USART 0 generic control                       */

                      /* Module WDT                                            */
sfr WDCTL     = 0xC9; /* WDT Watchdog Timer control                            */

                      /* I/O Registers                                         */
sfr PERCFG    = 0xF1; /* Peripheral Control                                    */
sfr APCFG     = 0xF2; /* Analog Peripheral I/O Configuration                   */
sfr P0SEL     = 0xF3; /* P0 Function Select                                    */
sfr P1SEL     = 0xF4; /* P1 Function Select                                    */
sfr P2SEL     = 0xF5; /* P2 Function Select                                    */
sfr PPRI      = 0xFB; /* Peripheral Priority Setup                             */
sfr P0DIR     = 0xFD; /* Port 0 Direction Control                              */
sfr P1DIR     = 0xFE; /* Port 1 Direction Control                              */
sfr P2DIR     = 0xFF; /* Port 2 Direction Control                              */
sfr P0INP     = 0x8F; /* Port 0 Input Mode                                     */
sfr P1INP     = 0xF6; /* Port 1 Input Mode                                     */
sfr P2INP     = 0xF7; /* Port 2 Input Mode                                     */
sfr PPULL     = 0xF8; /* Port Pullup/Pulldown Control                          */
sfr P0IFG     = 0x89; /* Port 0 Interrupt Status Flag                          */
sfr P1IFG     = 0x8A; /* Port 1 Interrupt Status Flag                          */
sfr P2IFG     = 0x8B; /* Port 2 Interrupt Status Flag                          */
sfr PICTL     = 0x8C; /* Port Interrupt Control                                */
sfr P0IEN     = 0xAB; /* Port 0 Interrupt Mask                                 */
sfr P1IEN     = 0x8D; /* Port 1 Interrupt Mask                                 */
sfr P2IEN     = 0xAC; /* Port 2 Interrupt Mask                                 */
sfr PMUX      = 0xAE; /* Power-Down Signal Mux                                 */

/*        Bit registers                                                        */
/* P0 Port 0 (0x80)                                                            */
sbit  P07      = P0^7;   /*                                                    */
sbit  P06      = P0^6;   /*                                                    */
sbit  P05      = P0^5;   /*                                                    */
sbit  P04      = P0^4;   /*                                                    */
sbit  P03      = P0^3;   /*                                                    */
sbit  P02      = P0^2;   /*                                                    */
sbit  P01      = P0^1;   /*                                                    */
sbit  P00      = P0^0;   /*                                                    */

/* P1 Port 1 (0x90)                                                            */
                         /* Bit 7 Reserved                                     */
                         /* Bit 6 Reserved                                     */
                         /* Bit 5 Reserved                                     */
sbit  P14      = P1^4;   /*                                                    */
sbit  P13      = P1^3;   /*                                                    */
sbit  P12      = P1^2;   /*                                                    */
sbit  P11      = P1^1;   /*                                                    */
sbit  P10      = P1^0;   /*                                                    */

