tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/CHIPCON/CC2543.h
/* P2 Port 2 (0xA0)                                                            */
                         /* Bit 7 Reserved                                     */
                         /* Bit 6 Reserved                                     */
                         /* Bit 5 Reserved                                     */
                         /* Bit 4 Reserved                                     */
                         /* Bit 3 Reserved                                     */
sbit  P22      = P2^2;   /*                                                    */
sbit  P21      = P2^1;   /*                                                    */
sbit  P20      = P2^0;   /*                                                    */

/* PSW Program Status Word (0xD0)                                              */
sbit  CY      = PSW^7;  /* Carry flag                                          */
sbit  AC      = PSW^6;  /* Auxiliary                                           */
sbit  F0      = PSW^5;  /* User defined                                        */
sbit  RS1     = PSW^4;  /* Register bank select bit 1                          */
sbit  RS0     = PSW^3;  /* Register bank select bit 0                          */
sbit  OV      = PSW^2;  /* Overflow                                            */
sbit  F1      = PSW^1;  /* User defined                                        */
sbit  P       = PSW^0;  /* Parity flag                                         */

/* IEN0 Interrupt Enable 0  (0xA8)                                             */
sbit  EA      = IEN0^7; /* Disables all interrupts                             */
                        /* Bit 6 Reserved                                      */
sbit  STIE    = IEN0^5; /* Sleep Timer interrupt enable                        */
sbit  ENCIE   = IEN0^4; /* AES encryption/decryption interrupt enable          */
                        /* Bit 3 Reserved                                      */
sbit  URX0IE  = IEN0^2; /* USART0 RX interrupt enable                          */
sbit  ADCIE   = IEN0^1; /* ADC interrupt enable (not available on the CC2544)  */
sbit  RFERRIE = IEN0^0; /* RF TXFIFO/RXFIFO interrupt enable                   */

/* IEN1 Interrupt Enable 0  (0xA8)                                             */
                        /* Bit 7 Reserved                                      */
                        /* Bit 6 Reserved                                      */
sbit   P0IE   = IEN1^5; /* Port 0 interrupt enable                             */
sbit   T4IE   = IEN1^4; /* Timer 4 interrupt enable                            */
sbit   T3IE   = IEN1^3; /* Timer 3 interrupt enable                            */
sbit   T2IE   = IEN1^2; /* Timer 2 interrupt enable                            */
sbit   T1IE   = IEN1^1; /* Timer 1 interrupt enable                            */
sbit   DMAIE  = IEN1^0; /* DMA transfer interrupt enable                       */

/* TCON Interrupt Flags (0x88)                                                 */
                         /* Bit 7 Reserved                                     */
                         /* Bit 6 Reserved                                     */
sbit   ADCIF   = TCON^5; /* ADC interrupt flag                                 */
                         /* Bit 4 Reserved                                     */
sbit   URX0IF  = TCON^3; /* USART RX interrupt flag                            */
sbit   IT1     = TCON^2; /* Reserved. Setting a zero enables low-level interrupt detection, which is almost the case. */
sbit   RFERRIF = TCON^1; /* RF TXFIFO/RXFIFO interrupt flag.                   */
sbit   IT0     = TCON^0; /* Reserved. Setting a zero enables low-level interrupt detection, which is almost the case. */

/* SCON Interrupt Flags 2(0x98)                                                */
                          /* Bit 7 Reserved                                    */
                          /* Bit 6 Reserved                                    */
                          /* Bit 5 Reserved                                    */
                          /* Bit 4 Reserved                                    */
                          /* Bit 3 Reserved                                    */
                          /* Bit 2 Reserved                                    */
sbit   ENCIF_1 = S0CON^1; /* AES interrupt flag 1                              */
sbit   ENCIF_0 = S0CON^0; /* AES interrupt flag 0                              */

/* IRCON Interrupt Flags 4(0xC0)                                               */
sbit  STIF    = IRCON^7; /* Sleep Timer interrupt flag                         */
                         /* Bit 6 Reserved                                     */
sbit  P0IF    = IRCON^5; /* Port 0 interrupt flag                              */
sbit  T4IF    = IRCON^4; /* Timer 4 interrupt flag.                            */
sbit  T3IF    = IRCON^3; /* Timer 3 interrupt flag.                            */
sbit  T2IF    = IRCON^2; /* Timer 2 interrupt flag.                            */
sbit  T1IF    = IRCON^1; /* Timer 1 interrupt flag.                            */
sbit  DMAIF   = IRCON^0; /* DMA-complete interrupt flag                        */

/* IRCON2 Interrupt Flags 5(0xE8)                                              */
                          /* Bit 7 Reserved                                    */
                          /* Bit 6 Reserved                                    */
                          /* Bit 5 Reserved                                    */
sbit  WDTIF   = IRCON2^4; /* Watchdog Timer interrupt flag                     */
sbit  P1IF    = IRCON2^3; /* Port 1 interrupt flag                             */
sbit  I2CIF   = IRCON2^2; /* I2C interrupt flag (N/A CC2544)                   */
sbit  UTX0IF  = IRCON2^1; /* USART 0 TX interrupt flag                         */
sbit  P2IF    = IRCON2^0; /* Port 2 interrupt flag                             */

/* PPULL Port Pullup/Pulldown Control (0xF8)                                   */
                         /* Bit 7 Reserved                                     */
                         /* Bit 6 Reserved                                     */
                         /* Bit 5 Reserved                                     */
sbit  PDUP2L  = PPULL^4; /* P2[2:0] pull direction                             */
sbit  PDUP1H  = PPULL^3; /* P1[6:4] pull direction                             */
sbit  PDUP1L  = PPULL^2; /* P1[3] pull direction                               */
sbit  PDUP0H  = PPULL^1; /* P0[7:4] pull direction                             */
sbit  PDUP0L  = PPULL^0; /* P0[3:0] pull direction                             */

/* TIMIF Timer 1/3/4 Interrupt Mask/Flag (0xD8)                                */
                          /* Bit 7 Reserved                                    */
sbit  T1OVFIM = TIMIF^6;  /* Timer 1 overflow interrupt mask                   */
sbit  T4CH1IF = TIMIF^5;  /* Timer 4 channel 1 interrupt flag                  */
sbit  T4CH0IF = TIMIF^4;  /* Timer 4 channel 0 interrupt flag                  */
sbit  T4OVFIF = TIMIF^3;  /* Timer 4 overflow interrupt flag                   */
sbit  T3CH1IF = TIMIF^2;  /* Timer 3 channel 1 interrupt flag                  */
sbit  T3CH0IF = TIMIF^1;  /* Timer 3 channel 0 interrupt flag                  */
sbit  T3OVFIF = TIMIF^0;  /* Timer 3 overflow interrupt flag                   */

/*-----------------------------------------------------------------------------*/
/*        RAM Based registers                                                  */
/*-----------------------------------------------------------------------------*/

#define PRF_CHAN           ((unsigned char volatile xdata *) 0)[0x6000]   /*  Frequency to use                             */
#define PRF_TASK_CONF      ((unsigned char volatile xdata *) 0)[0x6001]   /*  Configuration of task control                */
#define PRF_FIFO_CONF      ((unsigned char volatile xdata *) 0)[0x6002]   /*  Configure FIFO use                           */
#define PRF_PKT_CONF       ((unsigned char volatile xdata *) 0)[0x6003]   /*  Packet configuration                         */
#define PRF_CRC_LEN        ((unsigned char volatile xdata *) 0)[0x6004]   /*  Number of CRC bytes.                         */
#define PRF_RSSI_LIMIT     ((unsigned char volatile xdata *) 0)[0x6005]   /*  For transmit on clear channel.               */
#define PRF_RSSI_COUNTH    ((unsigned char volatile xdata *) 0)[0x6006]   /*  RSSI count high byte.                        */
#define PRF_RSSI_COUNTL    ((unsigned char volatile xdata *) 0)[0x6007]   /*  RSSI count low byte.                         */
#define PRF_CRC_INIT1      ((unsigned char volatile xdata *) 0)[0x6008]   /*  Initialization value for CRC byte 1 MSB      */
#define PRF_CRC_INIT2      ((unsigned char volatile xdata *) 0)[0x6009]   /*  Initialization value for CRC byte 2          */
#define PRF_CRC_INIT3      ((unsigned char volatile xdata *) 0)[0x600A]   /*  Initialization value for CRC byte 3          */
#define PRF_CRC_INIT4      ((unsigned char volatile xdata *) 0)[0x600B]   /*  Initialization value for CRC byte 4 LSB      */

#define PRF_W_INIT         ((unsigned char volatile xdata *) 0)[0x600C]   /*  */
#define PRF_RETRANS_CNT    ((unsigned char volatile xdata *) 0)[0x600D]   /*  Maximum number of retransmissions            */
#define PRF_TX_DELAYH      ((unsigned char volatile xdata *) 0)[0x600E]   /*  Delay between two tranmissions high byte     */
#define PRF_TX_DELAYL      ((unsigned char volatile xdata *) 0)[0x600F]   /*  Delay between two tranmissions low byte      */

#define PRF_RETRANS_DELAYH ((unsigned char volatile xdata *) 0)[0x6010]   /*  Delay between retranmissions high byte       */
#define PRF_RETRANS_DELAYL ((unsigned char volatile xdata *) 0)[0x6011]   /*  Delay between retranmissions low byte        */

#define PRF_SEARCH_TIMEH   ((unsigned char volatile xdata *) 0)[0x6012]   /*  Search time high byte                        */
#define PRF_SEARCH_TIMEL   ((unsigned char volatile xdata *) 0)[0x6013]   /*  Search time low byte                         */

