tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/CHIPCON/CC2543.h
#define PRF_RX_TX_TIMEH    ((unsigned char volatile xdata *) 0)[0x6014]   /*  */
#define PRF_RX_TX_TIMEL    ((unsigned char volatile xdata *) 0)[0x6015]   /*  */

#define PRF_TX_RX_TIMEH    ((unsigned char volatile xdata *) 0)[0x6016]   /*  */
#define PRF_TX_RX_TIMEL    ((unsigned char volatile xdata *) 0)[0x6017]   /*  */

#define PRF_ADDR_ENTRY01   ((unsigned char volatile xdata *) 0)[0x6018]   /*  */
#define PRF_ADDR_ENTRY02   ((unsigned char volatile xdata *) 0)[0x6019]   /*  */
#define PRF_ADDR_ENTRY03   ((unsigned char volatile xdata *) 0)[0x601A]   /*  */
#define PRF_ADDR_ENTRY04   ((unsigned char volatile xdata *) 0)[0x601B]   /*  */
#define PRF_ADDR_ENTRY05   ((unsigned char volatile xdata *) 0)[0x601C]   /*  */
#define PRF_ADDR_ENTRY06   ((unsigned char volatile xdata *) 0)[0x601D]   /*  */
#define PRF_ADDR_ENTRY07   ((unsigned char volatile xdata *) 0)[0x601E]   /*  */
#define PRF_ADDR_ENTRY08   ((unsigned char volatile xdata *) 0)[0x601F]   /*  */
#define PRF_ADDR_ENTRY09   ((unsigned char volatile xdata *) 0)[0x6020]   /*  */
#define PRF_ADDR_ENTRY0A   ((unsigned char volatile xdata *) 0)[0x6021]   /*  */
#define PRF_ADDR_ENTRY0B   ((unsigned char volatile xdata *) 0)[0x6022]   /*  */
#define PRF_ADDR_ENTRY0C   ((unsigned char volatile xdata *) 0)[0x6023]   /*  */

#define PRF_ADDR_ENTRY11   ((unsigned char volatile xdata *) 0)[0x6024]   /*  */
#define PRF_ADDR_ENTRY12   ((unsigned char volatile xdata *) 0)[0x6025]   /*  */
#define PRF_ADDR_ENTRY13   ((unsigned char volatile xdata *) 0)[0x6026]   /*  */
#define PRF_ADDR_ENTRY14   ((unsigned char volatile xdata *) 0)[0x6027]   /*  */
#define PRF_ADDR_ENTRY15   ((unsigned char volatile xdata *) 0)[0x6028]   /*  */
#define PRF_ADDR_ENTRY16   ((unsigned char volatile xdata *) 0)[0x6029]   /*  */
#define PRF_ADDR_ENTRY17   ((unsigned char volatile xdata *) 0)[0x602A]   /*  */
#define PRF_ADDR_ENTRY18   ((unsigned char volatile xdata *) 0)[0x602B]   /*  */
#define PRF_ADDR_ENTRY19   ((unsigned char volatile xdata *) 0)[0x602C]   /*  */
#define PRF_ADDR_ENTRY1A   ((unsigned char volatile xdata *) 0)[0x602D]   /*  */
#define PRF_ADDR_ENTRY1B   ((unsigned char volatile xdata *) 0)[0x602E]   /*  */
#define PRF_ADDR_ENTRY1C   ((unsigned char volatile xdata *) 0)[0x602F]   /*  */

#define PRF_ADDR_ENTRY21   ((unsigned char volatile xdata *) 0)[0x6030]   /*  */
#define PRF_ADDR_ENTRY22   ((unsigned char volatile xdata *) 0)[0x6031]   /*  */
#define PRF_ADDR_ENTRY23   ((unsigned char volatile xdata *) 0)[0x6032]   /*  */
#define PRF_ADDR_ENTRY24   ((unsigned char volatile xdata *) 0)[0x6033]   /*  */
#define PRF_ADDR_ENTRY25   ((unsigned char volatile xdata *) 0)[0x6034]   /*  */
#define PRF_ADDR_ENTRY26   ((unsigned char volatile xdata *) 0)[0x6035]   /*  */
#define PRF_ADDR_ENTRY27   ((unsigned char volatile xdata *) 0)[0x6036]   /*  */
#define PRF_ADDR_ENTRY28   ((unsigned char volatile xdata *) 0)[0x6037]   /*  */
#define PRF_ADDR_ENTRY29   ((unsigned char volatile xdata *) 0)[0x6038]   /*  */
#define PRF_ADDR_ENTRY2A   ((unsigned char volatile xdata *) 0)[0x6039]   /*  */
#define PRF_ADDR_ENTRY2B   ((unsigned char volatile xdata *) 0)[0x603A]   /*  */
#define PRF_ADDR_ENTRY2C   ((unsigned char volatile xdata *) 0)[0x603B]   /*  */

#define PRF_ADDR_ENTRY31   ((unsigned char volatile xdata *) 0)[0x603C]   /*  */
#define PRF_ADDR_ENTRY32   ((unsigned char volatile xdata *) 0)[0x603D]   /*  */
#define PRF_ADDR_ENTRY33   ((unsigned char volatile xdata *) 0)[0x603E]   /*  */
#define PRF_ADDR_ENTRY34   ((unsigned char volatile xdata *) 0)[0x603F]   /*  */
#define PRF_ADDR_ENTRY35   ((unsigned char volatile xdata *) 0)[0x6040]   /*  */
#define PRF_ADDR_ENTRY36   ((unsigned char volatile xdata *) 0)[0x6041]   /*  */
#define PRF_ADDR_ENTRY37   ((unsigned char volatile xdata *) 0)[0x6042]   /*  */
#define PRF_ADDR_ENTRY38   ((unsigned char volatile xdata *) 0)[0x6043]   /*  */
#define PRF_ADDR_ENTRY39   ((unsigned char volatile xdata *) 0)[0x6044]   /*  */
#define PRF_ADDR_ENTRY3A   ((unsigned char volatile xdata *) 0)[0x6045]   /*  */
#define PRF_ADDR_ENTRY3B   ((unsigned char volatile xdata *) 0)[0x6046]   /*  */
#define PRF_ADDR_ENTRY3C   ((unsigned char volatile xdata *) 0)[0x6047]   /*  */

#define PRF_ADDR_ENTRY41   ((unsigned char volatile xdata *) 0)[0x6048]   /*  */
#define PRF_ADDR_ENTRY42   ((unsigned char volatile xdata *) 0)[0x6049]   /*  */
#define PRF_ADDR_ENTRY43   ((unsigned char volatile xdata *) 0)[0x604A]   /*  */
#define PRF_ADDR_ENTRY44   ((unsigned char volatile xdata *) 0)[0x604B]   /*  */
#define PRF_ADDR_ENTRY45   ((unsigned char volatile xdata *) 0)[0x604C]   /*  */
#define PRF_ADDR_ENTRY46   ((unsigned char volatile xdata *) 0)[0x604D]   /*  */
#define PRF_ADDR_ENTRY47   ((unsigned char volatile xdata *) 0)[0x604E]   /*  */
#define PRF_ADDR_ENTRY48   ((unsigned char volatile xdata *) 0)[0x604F]   /*  */
#define PRF_ADDR_ENTRY49   ((unsigned char volatile xdata *) 0)[0x6050]   /*  */
#define PRF_ADDR_ENTRY4A   ((unsigned char volatile xdata *) 0)[0x6051]   /*  */
#define PRF_ADDR_ENTRY4B   ((unsigned char volatile xdata *) 0)[0x6052]   /*  */
#define PRF_ADDR_ENTRY4C   ((unsigned char volatile xdata *) 0)[0x6053]   /*  */

#define PRF_ADDR_ENTRY51   ((unsigned char volatile xdata *) 0)[0x6054]   /*  */
#define PRF_ADDR_ENTRY52   ((unsigned char volatile xdata *) 0)[0x6055]   /*  */
#define PRF_ADDR_ENTRY53   ((unsigned char volatile xdata *) 0)[0x6056]   /*  */
#define PRF_ADDR_ENTRY54   ((unsigned char volatile xdata *) 0)[0x6057]   /*  */
#define PRF_ADDR_ENTRY55   ((unsigned char volatile xdata *) 0)[0x6058]   /*  */
#define PRF_ADDR_ENTRY56   ((unsigned char volatile xdata *) 0)[0x6059]   /*  */
#define PRF_ADDR_ENTRY57   ((unsigned char volatile xdata *) 0)[0x605A]   /*  */
#define PRF_ADDR_ENTRY58   ((unsigned char volatile xdata *) 0)[0x605B]   /*  */
#define PRF_ADDR_ENTRY59   ((unsigned char volatile xdata *) 0)[0x605C]   /*  */
#define PRF_ADDR_ENTRY5A   ((unsigned char volatile xdata *) 0)[0x605D]   /*  */
#define PRF_ADDR_ENTRY5B   ((unsigned char volatile xdata *) 0)[0x605E]   /*  */
#define PRF_ADDR_ENTRY5C   ((unsigned char volatile xdata *) 0)[0x605F]   /*  */

