tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/CHIPCON/CC2543.h
#define PRF_ADDR_ENTRY61   ((unsigned char volatile xdata *) 0)[0x6060]   /*  */
#define PRF_ADDR_ENTRY62   ((unsigned char volatile xdata *) 0)[0x6061]   /*  */
#define PRF_ADDR_ENTRY63   ((unsigned char volatile xdata *) 0)[0x6062]   /*  */
#define PRF_ADDR_ENTRY64   ((unsigned char volatile xdata *) 0)[0x6063]   /*  */
#define PRF_ADDR_ENTRY65   ((unsigned char volatile xdata *) 0)[0x6064]   /*  */
#define PRF_ADDR_ENTRY66   ((unsigned char volatile xdata *) 0)[0x6065]   /*  */
#define PRF_ADDR_ENTRY67   ((unsigned char volatile xdata *) 0)[0x6066]   /*  */
#define PRF_ADDR_ENTRY68   ((unsigned char volatile xdata *) 0)[0x6067]   /*  */
#define PRF_ADDR_ENTRY69   ((unsigned char volatile xdata *) 0)[0x6068]   /*  */
#define PRF_ADDR_ENTRY6A   ((unsigned char volatile xdata *) 0)[0x6069]   /*  */
#define PRF_ADDR_ENTRY6B   ((unsigned char volatile xdata *) 0)[0x606A]   /*  */
#define PRF_ADDR_ENTRY6C   ((unsigned char volatile xdata *) 0)[0x606B]   /*  */

#define PRF_ADDR_ENTRY71   ((unsigned char volatile xdata *) 0)[0x606C]   /*  */
#define PRF_ADDR_ENTRY72   ((unsigned char volatile xdata *) 0)[0x606D]   /*  */
#define PRF_ADDR_ENTRY73   ((unsigned char volatile xdata *) 0)[0x606E]   /*  */
#define PRF_ADDR_ENTRY74   ((unsigned char volatile xdata *) 0)[0x606F]   /*  */
#define PRF_ADDR_ENTRY75   ((unsigned char volatile xdata *) 0)[0x6070]   /*  */
#define PRF_ADDR_ENTRY76   ((unsigned char volatile xdata *) 0)[0x6071]   /*  */
#define PRF_ADDR_ENTRY77   ((unsigned char volatile xdata *) 0)[0x6072]   /*  */
#define PRF_ADDR_ENTRY78   ((unsigned char volatile xdata *) 0)[0x6073]   /*  */
#define PRF_ADDR_ENTRY79   ((unsigned char volatile xdata *) 0)[0x6074]   /*  */
#define PRF_ADDR_ENTRY7A   ((unsigned char volatile xdata *) 0)[0x6075]   /*  */
#define PRF_ADDR_ENTRY7B   ((unsigned char volatile xdata *) 0)[0x6076]   /*  */
#define PRF_ADDR_ENTRY7C   ((unsigned char volatile xdata *) 0)[0x6077]   /*  */

#define PRF_N_TX           ((unsigned char volatile xdata *) 0)[0x6078]   /*  Total number of packets transmitted          */
#define PRF_LAST_RSSI      ((unsigned char volatile xdata *) 0)[0x6079]   /*  RSSI of last received packet                 */

#define PRF_LAST_DCOFF1    ((unsigned char volatile xdata *) 0)[0x607A]   /*  DC offset of last received packet byte 1 MSB */
#define PRF_LAST_DCOFF2    ((unsigned char volatile xdata *) 0)[0x607B]   /*  DC offset of last received packet byte 2     */
#define PRF_LAST_DCOFF3    ((unsigned char volatile xdata *) 0)[0x607C]   /*  DC offset of last received packet byte 3     */
#define PRF_LAST_DCOFF4    ((unsigned char volatile xdata *) 0)[0x607D]   /*  DC offset of last received packet byte 4 LSB */

#define PRF_RADIO_CONF     ((unsigned char volatile xdata *) 0)[0x607E]   /*  Configure radio hardware                     */

#define OBSSEL0            ((unsigned char volatile xdata *) 0)[0x6243]   /*  Observation output control register 0        */
#define OBSSEL1            ((unsigned char volatile xdata *) 0)[0x6244]   /*  Observation output control register 1        */
#define OBSSEL2            ((unsigned char volatile xdata *) 0)[0x6245]   /*  Observation output control register 2        */
#define OBSSEL3            ((unsigned char volatile xdata *) 0)[0x6246]   /*  Observation output control register 3        */
#define OBSSEL4            ((unsigned char volatile xdata *) 0)[0x6247]   /*  Observation output control register 4        */
#define OBSSEL5            ((unsigned char volatile xdata *) 0)[0x6248]   /*  Observation output control register 5        */

/*             Variables in RAM Page 5                                  */
#define PRFX_LAST_FREQEST        ((unsigned char volatile xdata *) 0)[0x6006]   /*  */ 
#define PRFX_RSSI_LIM_LOWER      ((unsigned char volatile xdata *) 0)[0x6008]   /*  */ 
#define PRFX_RSSI_LIM_UPPER      ((unsigned char volatile xdata *) 0)[0x6009]   /*  */ 
#define PRFX_RSSI_DIFF           ((unsigned char volatile xdata *) 0)[0x600A]   /*  */ 
#define PRFX_LNAGAIN_SAT         ((unsigned char volatile xdata *) 0)[0x600B]   /*  */ 

#define PRFX_TONE_DURATIONH      ((unsigned char volatile xdata *) 0)[0x600C]   /*  */ 
#define PRFX_TONE_DURATIONL      ((unsigned char volatile xdata *) 0)[0x600D]   /*  */ 

#define PRFX_TONE_OFFSETH        ((unsigned char volatile xdata *) 0)[0x600E]   /*  */ 
#define PRFX_TONE_OFFSETL        ((unsigned char volatile xdata *) 0)[0x600F]   /*  */ 

/*            XREG Registers                                                    */
#define FRMCTRL0                 ((unsigned char volatile xdata *) 0)[0x6180]   /*  */
#define RFIRQM0                  ((unsigned char volatile xdata *) 0)[0x6181]   /* RF Interrupt Masks                      */
#define RFIRQM1                  ((unsigned char volatile xdata *) 0)[0x6182]   /* RF Interrupt Masks                      */
#define RFERRM                   ((unsigned char volatile xdata *) 0)[0x6183]   /* RF Error Interrupt Masks                */
#define FREQCTRL                 ((unsigned char volatile xdata *) 0)[0x6184]   /* Synth Frequency Control                 */
#define FREQTUNE                 ((unsigned char volatile xdata *) 0)[0x6185]   /* Crystal Oscillator Frequency Tuning     */
#define TXPOWER                  ((unsigned char volatile xdata *) 0)[0x6186]   /* Output Power Control                    */
#define TXCTRL                   ((unsigned char volatile xdata *) 0)[0x6187]   /* Tx Settings                             */
#define LLESTAT                  ((unsigned char volatile xdata *) 0)[0x6188]   /* LLE Status                              */
#define SEMAPHORE0               ((unsigned char volatile xdata *) 0)[0x618A]   /* Semaphore0 for Accessing RF Data Memory */
#define SEMAPHORE1               ((unsigned char volatile xdata *) 0)[0x618B]   /* Semaphore1 for Accessing RF Data Memory */
#define SEMAPHORE2               ((unsigned char volatile xdata *) 0)[0x618C]   /* Semaphore2 for Accessing RF Data Memory */
#define RFSTAT                   ((unsigned char volatile xdata *) 0)[0x618D]   /* RF Core Status                          */
#define RSSI                     ((unsigned char volatile xdata *) 0)[0x618E]   /* Received Signal Strength Indicator      */
#define RFPSRND                  ((unsigned char volatile xdata *) 0)[0x618F]   /* Pseudo-Random Number Generator          */
#define MDMCTRL0                 ((unsigned char volatile xdata *) 0)[0x6190]   /* Modem Configuration                     */
#define MDMCTRL1                 ((unsigned char volatile xdata *) 0)[0x6191]   /* Modem Configuration                     */
#define MDMCTRL2                 ((unsigned char volatile xdata *) 0)[0x6192]   /* Modem Configuration                     */
#define MDMCTRL3                 ((unsigned char volatile xdata *) 0)[0x6193]   /* Modem Configuration                     */
#define SW_CONF                  ((unsigned char volatile xdata *) 0)[0x6194]   /* Sync Word Configuration                 */
#define SW0                      ((unsigned char volatile xdata *) 0)[0x6195]   /* Primary Sync Word Byte 0                */
#define SW1                      ((unsigned char volatile xdata *) 0)[0x6196]   /* Primary Sync Word Byte 1                */
#define SW2                      ((unsigned char volatile xdata *) 0)[0x6197]   /* Primary Sync Word Byte 2                */
#define SW3                      ((unsigned char volatile xdata *) 0)[0x6198]   /* Primary Sync Word Byte 3                */
#define FREQEST                  ((unsigned char volatile xdata *) 0)[0x6199]   /* Estimated RF Frequency Offset           */
#define RXCTRL                   ((unsigned char volatile xdata *) 0)[0x619A]   /* Receive Section Tuning                  */
#define FSCTRL                   ((unsigned char volatile xdata *) 0)[0x619B]   /* Frequency Synthesizer Tuning            */
#define LNAGAIN                  ((unsigned char volatile xdata *) 0)[0x61A0]   /* LNA Gain Setting                        */
#define AAFGAIN                  ((unsigned char volatile xdata *) 0)[0x61A1]   /* AAF Gain Setting                        */
#define ADCTEST0                 ((unsigned char volatile xdata *) 0)[0x61A2]   /* ADC Tuning                              */
#define MDMTEST0                 ((unsigned char volatile xdata *) 0)[0x61A5]   /* Modem Configuration                     */
#define MDMTEST1                 ((unsigned char volatile xdata *) 0)[0x61A6]   /* Modem Configuration                     */
#define ATEST                    ((unsigned char volatile xdata *) 0)[0x61A9]   /* Analog Test Control                     */
#define RFC_OBS_CTRL0            ((unsigned char volatile xdata *) 0)[0x61AE]   /* RF Observation Mux Control 0            */
#define RFC_OBS_CTRL1            ((unsigned char volatile xdata *) 0)[0x61AF]   /* RF Observation Mux Control 1            */
#define RFC_OBS_CTRL2            ((unsigned char volatile xdata *) 0)[0x61B0]   /* RF Observation Mux Control 2            */
#define LLECTRL                  ((unsigned char volatile xdata *) 0)[0x61B1]   /* LLE Control                             */
#define ACOMPQS                  ((unsigned char volatile xdata *) 0)[0x61B6]   /* Quadrature Skew Setting                 */
#define TXFILTCFG                ((unsigned char volatile xdata *) 0)[0x61BC]   /* TX Filter Configuration                 */
#define RFRND                    ((unsigned char volatile xdata *) 0)[0x61BF]   /* Random Data                             */
#define RFRAMCFG                 ((unsigned char volatile xdata *) 0)[0x61C0]   /* Radio RAM Configuration                 */
#define RFFDMA0                  ((unsigned char volatile xdata *) 0)[0x61C3]   /* Radio DMA Trigger 0 Control             */
#define RFFDMA1                  ((unsigned char volatile xdata *) 0)[0x61C4]   /* Radio DMA Trigger 1 Control             */
#define RFFSTATUS                ((unsigned char volatile xdata *) 0)[0x61C5]   /* FIFO Status                             */
#define RFFCFG                   ((unsigned char volatile xdata *) 0)[0x61C6]   /* FIFO Configuration                      */
#define RFRXFLEN                 ((unsigned char volatile xdata *) 0)[0x61C8]   /* Rx FIFO Length                          */
#define RFRXFTHRS                ((unsigned char volatile xdata *) 0)[0x61C9]   /* Rx FIFO Threshold                       */
#define RFRXFWR                  ((unsigned char volatile xdata *) 0)[0x61CA]   /* Rx FIFO Write Register                  */
#define RFRXFRD                  ((unsigned char volatile xdata *) 0)[0x61CB]   /* Rx FIFO Read Register                   */
#define RFRXFWP                  ((unsigned char volatile xdata *) 0)[0x61CC]   /* Rx FIFO Write Pointer                   */
#define RFRXFRP                  ((unsigned char volatile xdata *) 0)[0x61CD]   /* Rx FIFO Read Pointer                    */
#define RFRXFSWP                 ((unsigned char volatile xdata *) 0)[0x61CE]   /* Rx FIFO Start-of-Frame Write Pointer    */
#define RFRXFSRP                 ((unsigned char volatile xdata *) 0)[0x61CF]   /* Rx FIFO Start-of-Frame Read Pointer     */
#define RFTXFLEN                 ((unsigned char volatile xdata *) 0)[0x61D0]   /* Tx FIFO Length                          */
#define RFTXFTHRS                ((unsigned char volatile xdata *) 0)[0x61D1]   /* Tx FIFO Threshold                       */
#define RFTXFWR                  ((unsigned char volatile xdata *) 0)[0x61D2]   /* Tx FIFO Write Register                  */
#define RFTXFRD                  ((unsigned char volatile xdata *) 0)[0x61D3]   /* Tx FIFO Read Register                   */
#define RFTXFWP                  ((unsigned char volatile xdata *) 0)[0x61D4]   /* Tx FIFO Write Pointer                   */
#define RFTXFRP                  ((unsigned char volatile xdata *) 0)[0x61D5]   /* Tx FIFO Read Pointer                    */
#define RFTXFSWP                 ((unsigned char volatile xdata *) 0)[0x61D6]   /* Tx FIFO Start-of-Frame Write Pointer    */
#define RFTXFSRP                 ((unsigned char volatile xdata *) 0)[0x61D7]   /* Tx FIFO Start-of-Frame Read Pointer     */
#define BSP_P0                   ((unsigned char volatile xdata *) 0)[0x61E0]   /* CRC Polynomial Byte 0                   */
#define BSP_P1                   ((unsigned char volatile xdata *) 0)[0x61E1]   /* CRC Polynomial Byte 1                   */
#define BSP_P2                   ((unsigned char volatile xdata *) 0)[0x61E2]   /* CRC Polynomial Byte 2                   */
#define BSP_P3                   ((unsigned char volatile xdata *) 0)[0x61E3]   /* CRC Polynomial Byte 3                   */
#define BSP_D0                   ((unsigned char volatile xdata *) 0)[0x61E4]   /* CRC Value Byte 0                        */
#define BSP_D1                   ((unsigned char volatile xdata *) 0)[0x61E5]   /* CRC Value Byte 1                        */
#define BSP_D2                   ((unsigned char volatile xdata *) 0)[0x61E6]   /* CRC Value Byte 2                        */
#define BSP_D3                   ((unsigned char volatile xdata *) 0)[0x61E7]   /* CRC Value Byte 3                        */
#define BSP_W                    ((unsigned char volatile xdata *) 0)[0x61E8]   /* Whitener Value                          */
#define BSP_MODE                 ((unsigned char volatile xdata *) 0)[0x61E9]   /* Bit Stream Processor Configuration      */
#define BSP_DATA                 ((unsigned char volatile xdata *) 0)[0x61EA]   /* Bit Stream Processor Co-Processor Data  */
#define SW4                      ((unsigned char volatile xdata *) 0)[0x61F8]   /* Secondary Sync Word Byte 0              */
#define SW5                      ((unsigned char volatile xdata *) 0)[0x61F9]   /* Secondary Sync Word Byte 1              */
#define SW6                      ((unsigned char volatile xdata *) 0)[0x61FA]   /* Secondary Sync Word Byte 2              */
#define SW7                      ((unsigned char volatile xdata *) 0)[0x61FB]   /* Secondary Sync Word Byte 3              */
#define DC_I_L                   ((unsigned char volatile xdata *) 0)[0x61FC]   /* In-Phase DC Offset Estimate Low Byte    */
#define DC_I_H                   ((unsigned char volatile xdata *) 0)[0x61FD]   /* In-Phase DC Offset Estimate High Byte   */
#define DC_Q_L                   ((unsigned char volatile xdata *) 0)[0x61FE]   /* Quadrature-Phase DC Offset Estimate Low Byte  */
#define DC_Q_H                   ((unsigned char volatile xdata *) 0)[0x61FF]   /* Quadrature-Phase DC Offset Estimate High Byte */

