tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/CHIPCON/CC2543.h
/*            USB registers                                                    */
#define USBADDR                  ((unsigned char volatile xdata *) 0)[0x6200]   /* Function Address                        */
#define USBPOW                   ((unsigned char volatile xdata *) 0)[0x6201]   /* Power/Control Register                  */
#define USBIIF                   ((unsigned char volatile xdata *) 0)[0x6202]   /* IN Endpoints and EP0 Interrupt Flags    */
#define USBOIF                   ((unsigned char volatile xdata *) 0)[0x6204]   /* OUT-Endpoint Interrupt Flags            */
#define USBCIF                   ((unsigned char volatile xdata *) 0)[0x6206]   /* Common USB Interrupt Flags              */
#define USBIIE                   ((unsigned char volatile xdata *) 0)[0x6207]   /* IN Endpoints and EP0 Interrupt-Enable Mask  */
#define USBOIE                   ((unsigned char volatile xdata *) 0)[0x6209]   /* Out Endpoints Interrupt Enable Mask     */
#define USBCIE                   ((unsigned char volatile xdata *) 0)[0x620B]   /* Common USB Interrupt-Enable Mask        */
#define USBFRML                  ((unsigned char volatile xdata *) 0)[0x620B]   /* Current Frame Number (low byte)         */
#define USBFRMH                  ((unsigned char volatile xdata *) 0)[0x620C]   /* Current Frame Number (high byte)        */
#define USBINDEX                 ((unsigned char volatile xdata *) 0)[0x620E]   /* Current-Endpoint Index Register         */
#define USBCTRL                  ((unsigned char volatile xdata *) 0)[0x620F]   /* USB Control Register                    */
#define USBMAXI                  ((unsigned char volatile xdata *) 0)[0x6210]   /* Max. Packet Size for IN Endpoint{1–5}   */
#define USBCS0                   ((unsigned char volatile xdata *) 0)[0x6211]   /* EP0 Control and Status (USBINDEX = 0)   */
#define USBCSIL                  ((unsigned char volatile xdata *) 0)[0x6211]   /* IN EP{1–5} Control and Status, low      */
#define USBCSIH                  ((unsigned char volatile xdata *) 0)[0x6212]   /* IN EP{1–5} Control and Status, high     */
#define USBMAXO                  ((unsigned char volatile xdata *) 0)[0x6213]   /* Max. Packet Size for OUT EP{1–5}        */
#define USBCSOL                  ((unsigned char volatile xdata *) 0)[0x6214]   /* OUT EP{1–5} Control and Status, low     */
#define USBCSOH                  ((unsigned char volatile xdata *) 0)[0x6215]   /* OUT EP{1–5} Control and Status, High    */
#define USBCNT0                  ((unsigned char volatile xdata *) 0)[0x6216]   /* Number of Received Bytes in EP0 FIFO (USBINDEX = 0)   */
#define USBCNTL                  ((unsigned char volatile xdata *) 0)[0x6216]   /* Number of Bytes in EP{1–5} OUT FIFO, Low              */
#define USBCNTH                  ((unsigned char volatile xdata *) 0)[0x6217]   /* Number of Bytes in EP{1–5} OUT FIFO, High             */
#define USBF0                    ((unsigned char volatile xdata *) 0)[0x6220]   /* Endpoint-0 FIFO                         */
#define USBF1                    ((unsigned char volatile xdata *) 0)[0x6222]   /* Endpoint-1 FIFO                         */
#define USBF2                    ((unsigned char volatile xdata *) 0)[0x6224]   /* Endpoint-2 FIFO                         */
#define USBF3                    ((unsigned char volatile xdata *) 0)[0x6226]   /* Endpoint-3 FIFO                         */
#define USBF4                    ((unsigned char volatile xdata *) 0)[0x6228]   /* Endpoint-4 FIFO                         */
#define USBF5                    ((unsigned char volatile xdata *) 0)[0x622A]   /* Endpoint-5 FIFO                         */
#define TR0                      ((unsigned char volatile xdata *) 0)[0x624B]   /* Test Register 0                         */

/*            Debug interface registers                                                    */
#define DBGDATA                  ((unsigned char volatile xdata *) 0)[0x6260]   /* Debug Data                              */
#define CHVER                    ((unsigned char volatile xdata *) 0)[0x6249]   /* Chip Version                            */
#define CHIPID                   ((unsigned char volatile xdata *) 0)[0x624A]   /* Chip ID                                 */
#define CHIPINFO0                ((unsigned char volatile xdata *) 0)[0x6276]   /* Chip Information Byte 0                 */
#define CHIPINFO1                ((unsigned char volatile xdata *) 0)[0x6277]   /* Chip Information Byte 1                 */

/*            Power management                                                            */
#define SRCRC                    ((unsigned char volatile xdata *) 0)[0x6262]   /* Sleep Reset CRC (not available on the CC2544) */

/*            Clock-Loss Detector                                                         */
#define CLD                      ((unsigned char volatile xdata *) 0)[0x6290]   /* Clock-Loss detection                    */

/*            Flash controller registers                                                  */
#define FCTL                     ((unsigned char volatile xdata *) 0)[0x6270]   /* Flash Control                           */
#define FWDATA                   ((unsigned char volatile xdata *) 0)[0x6273]   /* Flash write data                        */
#define FADDRH                   ((unsigned char volatile xdata *) 0)[0x6272]   /* Flash-Address high byte                 */
#define FADDRL                   ((unsigned char volatile xdata *) 0)[0x6271]   /* Flash-Address low byte                  */

/*            Timer registers                                                             */
#define T1CCTL3                  ((unsigned char volatile xdata *) 0)[0x62A3]   /* Timer 1 Channel 3 Capture/Compare control     */
#define T1CC3H                   ((unsigned char volatile xdata *) 0)[0x62AD]   /* Timer 1 Channel 3 Capture/Compare value, high */
#define T1CC3L                   ((unsigned char volatile xdata *) 0)[0x62AC]   /* Timer 1 Channel 3 Capture/Compare value, low  */
#define T1CCTL4                  ((unsigned char volatile xdata *) 0)[0x62A4]   /* Timer 1 Channel 4 Capture/Compare control     */
#define T1CC4H                   ((unsigned char volatile xdata *) 0)[0x62AF]   /* Timer 1 Channel 4 Capture/Compare value, high */
#define T1CC4L                   ((unsigned char volatile xdata *) 0)[0x62AE]   /* Timer 1 Channel 4 Capture/Compare value, low  */
#define IRCTL                    ((unsigned char volatile xdata *) 0)[0x6281]   /* Timer 1 IR Generation Control                 */

/*            Sleep timer registers                                                       */
#define STCC                     ((unsigned char volatile xdata *) 0)[0x62B0]   /* Sleep timer capture control                   */
#define STCS                     ((unsigned char volatile xdata *) 0)[0x62B1]   /* Sleep Timer Capture Status                    */
#define STCV0                    ((unsigned char volatile xdata *) 0)[0x62B2]   /* Sleep Timer Capture Value Byte 0              */
#define STCV1                    ((unsigned char volatile xdata *) 0)[0x62B3]   /* Sleep Timer Capture Value Byte 1              */
#define STCV2                    ((unsigned char volatile xdata *) 0)[0x62B4]   /* Sleep Timer Capture Value Byte 2              */

/*            I2C registers                                                              */
#define I2CCFG                    ((unsigned char volatile xdata *) 0)[0x6230]   /* I2C control                                  */
#define I2CSTAT                   ((unsigned char volatile xdata *) 0)[0x6231]   /* I2C status                                   */
#define I2CDATA                   ((unsigned char volatile xdata *) 0)[0x6232]   /* I2C data                                     */
#define I2CADDR                   ((unsigned char volatile xdata *) 0)[0x6233]   /* I2C own slave address                        */

/*            Analog comparator                                                          */
#define CMPCTL                    ((unsigned char volatile xdata *) 0)[0x62D0]   /* Analog Comparator Control and Status         */



#endif   /* __CC2543_H__ */
